import json
import os

from bson import ObjectId
from flask import Blueprint, current_app, request
from db import mongo

script_dir = os.path.dirname(os.path.abspath(__file__))
yaml_file_path = os.path.join(script_dir, '..', 'config.yaml')
settings = Blueprint('settings', __name__, url_prefix='/settings')


@settings.route('/')
def papers_index():
    return "This is the settings index page."


@settings.route('/getsettings')
def getsettings():
    client = current_app.extensions['mongo_client']
    data = mongo.find(client, 'settings')
    return data


@settings.route('/getplaylist')
def getplaylist():
    playlists = [
    {
        "src": "./music/偏爱.mp3",
        "poster": "https://raw.gitmirror.com/xinsi-tecool/mypic/main/4cfaff48-34b4-4ad4-9234-fc6814ef79d9.png",
        "lyrics": "http://192.168.4.102:5000/api/settings/lyrics?name=偏爱",
        "title": "偏爱",
        "artist": "张芸京"
    },
    {
        "src": "./music/星空下的梦想.mp3",
        "poster": "https://raw.gitmirror.com/xinsi-tecool/mypic/main/7a102e3b-a69d-45fb-837c-450dd921fccd.png",
        "lyrics": "http://192.168.4.102:5000/api/settings/lyrics?name=星空下的梦想",
        "title": "星空下的梦想",
        "artist": "星空下的梦想"
    },
    {
        "src": "./music/如愿.mp3",
        "poster": "https://raw.gitmirror.com/xinsi-tecool/mypic/main/4cfaff48-34b4-4ad4-9234-fc6814ef79d9.png",
        "lyrics": "http://192.168.4.102:5000/api/settings/lyrics?name=如愿",
        "title": "如愿",
        "artist": "王菲"
    },
    {
        "src": "./music/遥遥.mp3",
        "poster": "https://raw.gitmirror.com/xinsi-tecool/mypic/main/21aee897-ee97-47cb-92cb-1f6ac6f3d05c.jpeg",
        "lyrics": "http://192.168.4.102:5000/api/settings/lyrics?name=遥遥",
        "title": "遥遥",
        "artist": "遥遥"
    }
]
    return json.dumps(playlists)

@settings.route('/lyrics')
def get_lyrics():
    name = request.args.get('name')

    if name == '偏爱':
        ly = """[00:00.000]LRC-musicenc.com
[00:01.000] 作词 : 葛大为

[00:02.000] 作曲 : 陈伟

[00:15.50]把昨天都作废

[00:18.91]现在你在我眼前

[00:22.69]我想爱 请给我机会

[00:29.19]如果我错了也承担

[00:33.07]认定你就是答案

[00:37.76]我不怕谁嘲笑我极端

[00:42.07]

[00:42.92]相信自己的直觉

[00:46.78]顽固的人不喊累

[00:50.27]爱上你 我不撤退

[00:55.19]

[00:55.70]我说过 我不闪躲

[00:59.12]我非要这么做

[01:01.83]讲不听 也偏要爱

[01:04.27]更努力爱 让你明白

[01:09.37]没有别条路能走

[01:12.58]你决定要不要陪我

[01:15.50]讲不听 偏爱

[01:17.22]靠我感觉爱

[01:18.94]等你的依赖

[01:21.90]对你偏爱

[01:29.18]痛也很愉快

[01:36.06]

[01:37.82]把昨天都作废

[01:41.20]现在你在我眼前

[01:44.91]我想爱 请给我机会

[01:51.49]如果我错了也承担

[01:55.40]认定你就是答案

[02:00.14]我不怕谁嘲笑我极端

[02:04.37]

[02:05.18]相信自己的直觉

[02:09.05]顽固的人不喊累

[02:12.54]爱上你 我不撤退

[02:17.59]

[02:18.01]我说过 我不闪躲

[02:21.44]我非要这么做

[02:24.09]讲不听 也偏要爱

[02:26.55]更努力爱 让你明白

[02:31.79]没有别条路能走

[02:34.77]你决定要不要陪我

[02:37.80]讲不听 偏爱

[02:39.54]靠我感觉爱

[02:41.20]等你的依赖

[02:44.04]

[02:44.22]不后悔 有把握

[02:47.12]我不闪躲 我非要这么做

[02:51.46]讲不听 也偏要爱

[02:53.92]更努力爱 让你明白

[02:59.16]没有别条路能走

[03:02.17]你决定要不要陪我

[03:05.22]讲不听 偏爱

[03:06.95]靠我感觉爱

[03:08.74]等你的依赖

[03:11.64]对你偏爱 爱

[03:18.91]痛也很愉快

[03:26.57]
"""
    elif name == "星空下的梦想":
        ly = """
            [00:00.000]LRC-musicenc.com
        [00:00]作词: 李紫昕
        [00:02]作曲: 李紫昕
        [00:04]原唱: 郭易
        [00:06]编曲：谢苑秋
        [00:09]和声：何婧
        [00:11]混音：谢苑秋
        [00:13]录音：旺仔小乔
        [00:16]制作人：王冬冬
        [00:18]OP：广东原创动力文化传播有限公司
        [00:20]看看星光看月亮
        [00:24]看看我的心
        [00:28]月亮代表我的心
        [00:32]梦想是甜蜜蜜
        [00:37]追寻的路永不完
        [00:41]纵然多遥远
        [00:45]我不会迷失方向
        [00:49]我拥有星光
        [00:53]在光辉中看见
        [00:57]未来的出现
        [01:01]终有一年
        [01:03]终有一天
        [01:05]终于回你身边
        [01:10]求求星光求月亮
        [01:14]听听我心愿
        [01:18]但愿爱充满世间
        [01:22]幸福永不变
        [01:43]啦啦啦啦啦啦啦啦啦啦啦啦
        [01:47]啦啦啦啦啦啦啦啦啦啦啦啦
        [01:59]在光辉中看见
        [02:04]未来的出现
        [02:07]终有一年终有一天
        [02:12]终于回你身边
        [02:16]求求星光求月亮
        [02:20]听听我心愿
        [02:24]但愿爱充满世间
        [02:28]幸福永不变
        [02:33]但愿梦想会实现
        [02:37]坚持永不变
            """
    elif name == "如愿":
        ly = """"[00:00.000]LRC-musicenc.com
[00:00]如愿 - 王菲
[00:14]词：唐恬
[00:22]曲：钱雷
[00:31]你是 遥遥的路
[00:34]山野大雾里的灯
[00:39]我是孩童啊 走在你的眼眸
[00:45]你是 明月清风
[00:48]我是你照拂的梦
[00:54]见与不见都一生 与你相拥
[00:59]而我将 爱你所爱的人间
[01:03]愿你所愿的笑颜
[01:07]你的手我蹒跚在牵
[01:10]请带我去明天
[01:14]如果说 你曾苦过我的甜
[01:18]我愿活成你的愿
[01:21]愿不枉啊 愿勇往啊
[01:25]这盛世每一天
[01:59]你是 岁月长河
[02:03]星火燃起的天空
[02:08]我是仰望者 就把你唱成歌
[02:14]你是 我之所来
[02:17]也是我心之所归
[02:22]世间所有路都将 与你相逢
[02:28]而我将 爱你所爱的人间
[02:32]愿你所愿的笑颜
[02:35]你的手我蹒跚在牵
[02:39]请带我去明天
[02:42]如果说 你曾苦过我的甜
[02:46]我愿活成你的愿
[02:50]愿不枉啊 愿勇往啊
[02:53]这盛世每一天
[02:58]山河无恙 烟火寻常
[03:02]可是你如愿的眺望
[03:06]孩子们啊 安睡梦乡
[03:09]像你深爱的那样
[03:18]而我将 梦你所梦的团圆
[03:22]愿你所愿的永远
[03:26]走你所走的长路
[03:30]这样的爱你啊
[03:33]我也将 见你未见的世界
[03:37]写你未写的诗篇
[03:40]天边的月 心中的念
[03:44]你永在我身边
[03:49]与你相约 一生清澈
[03:54]如你年轻的脸"""
    elif name == "遥遥":
        ly = """[00:00.000]LRC-musicenc.com
[00:00]遥遥-陈恒媛
[00:00]词：十二兄
[00:01]曲：孙长磊_Sun
[00:02]编曲：彭轩@XYMusic
[00:03]录音工程师：Cy.S @QuarkStudio
[00:04]混音母带工程师：幺橯
[00:04]海报：长夜蓝
[00:05]制作人：傅悦
[00:06]监制：陆棠疏
[00:07]和声编写：傅悦
[00:08]宣发：Jeff
[00:09]发行：声玩文化
[00:09]推广：因吹斯汀计划
[00:10]未经著作权人许可不得翻唱翻录或使用。
[00:20]我望着远方
[00:22]身边空荡荡
[00:25]没人陪我看花飞扬听雨落窗
[00:30]你走的匆忙
[00:32]来不及回望
[00:35]留给我一地秋霜
[00:40]情深难久长
[00:42]相思两茫茫
[00:45]你又何必遇见了我惹我惆怅
[00:49]心满是悲凉
[00:52]爱满是沧桑
[00:54]我不肯将你遗忘
[00:59]我放你在心上
[01:03]护你去向远方
[01:08]为什么情深一往
[01:11]换满身的伤
[01:13]没你的岁月太漫长
[01:18]我对你遥遥望
[01:20]望月光落成了霜
[01:23]洒满我的眼眶不敢回望
[01:28]原来有你在身旁
[01:30]月是那么明亮
[01:33]我怎么能怎么能忘
[01:57]情深难久长
[02:00]相思两茫茫
[02:02]你又何必遇见了我惹我惆怅
[02:07]心满是悲凉
[02:10]爱满是沧桑
[02:12]我不肯将你遗忘
[02:16]我放你在心上
[02:21]护你去向远方
[02:26]为什么情深一往
[02:29]换满身的伤
[02:31]没你的岁月太漫长
[02:36]我对你遥遥望
[02:38]望月光落成了霜
[02:41]洒满我的眼眶不敢回望
[02:46]原来有你在身旁
[02:48]月是那么明亮
[02:51]我怎么能怎么能忘
[02:55]我对你遥遥想
[02:57]想那时你的模样
[03:00]想到我的心上填满忧伤
[03:05]原来没你的地方
[03:08]风是那么冰凉
[03:10]夜那么的那么的长"""
    return ly

@settings.route('/putsettings')
def putsettings():
    pass

    res = mongo.put_object(client,'settings',query)
    print(res)
    return "success"

